INSERT INTO books (name, price, stock, count)
VALUES 
('Властелин Колец: Трилогия', 4500, 'Сормовский', 15),
('Big Java', 5000, 'Нижегородский', 9),
('C++ 11', 7000, 'Московский', 1),
('C# .NET', 3000, 'Ленинский', 23),
('Грокаем Алгоритмы', 1350, 'Автозавод', 17),
('Компьютерные сети', 3600, 'Совестский', 19),
('Блокчейн', 2000, 'Сормовский', 1)


INSERT INTO shop (name, area, commissary)
VALUES 
('Мир книги', 'Автозавод', 13),
('Книжный', 'Ленинский', 2),
('Дирижабль', 'Сормовский', 5),
('Деловая книга', 'Нижегородский', 17),
('Книжная база', 'Советский', 9)


INSERT INTO customer (surname, home, discount)
VALUES 
('Иванов', 'Автозавод', 13),
('Петров', 'Ленинский', 12),
('Семенов', 'Сормовский', 3),
('Иванова', 'Нижегородский', 25),
('Петрова', 'Советский', 9)

INSERT INTO buy (date, shop_id, customer_id, book_id, quanity, price)
VALUES 
('2020-09-13 13:00:00', 4, 1, 10, 3,15000),
('2021-01-29 17:50:00', 5, 5, 7, 5, 75),
('2022-03-15 14:42:05', 6, 4, 9, 1, 4500),
('2022-09-13 09:09:09', 9, 7, 11, 1, 7000),
('2022-05-05 17:50:01', 7, 3, 8, 10, 150000),
('2022-11-25 16:16:16', 8, 6, 10, 5, 25000)